// ---------- 创建房间相关
codeList[20001] = "房间不合法"
codeList[20002] = "房间人数设置不合法"
codeList[20003] = "CodeCreateRoomFailure"
codeList[20004] = "已经创建房间 退出即可"
// ---------- 房间相关
codeList[20101] = "房间不存在"
codeList[20102] = "当前房间不在游戏中"
codeList[20103] = "当前房间在游戏中"
codeList[20104] = "房间成员不存在"
codeList[20105] = "当前房间不在选题中"
// ---------- 加入房间相关
codeList[20200] = "加入房间失败"
codeList[20201] = "房间已经满人"
codeList[20202] = "已经加入房间"
codeList[20203] = "密码错误"
// ---------- 房间推送相关
codeList[20300] = "收到房间推送"
// ---------- 离开房间相关
codeList[20400] = "离开房间失败"
codeList[20401] = "游戏中 不能离开房间"
codeList[20402] = "选题中 不能离开房间"
// ---------- 准备相关
codeList[20500] = "准备失败"
codeList[20501] = "还有玩家没有准备"
codeList[20502] = "人数太少 最少三个人"
codeList[20503] = "游戏已经开始 不可以准备"
codeList[20504] = "你已经准备 请勿重复准备"
codeList[20505] = "你已经取消 请勿重复取消"
// ---------- 踢人相关
codeList[20600] = "踢人失败"
codeList[20601] = "踢人参数错误"
codeList[20602] = "此人不存在 无法踢人"
codeList[20603] = "不能踢自己"
codeList[20604] = "你不是房主 没有权限踢人"
// ---------- 交换位置相关
codeList[20700] = "交换位置失败"
codeList[20701] = "当前座位已经有人"
// ---------- 结束游戏相关
codeList[20800] = "结束游戏失败"
codeList[20801] = "游戏不在游戏中不能结束"
// ---------- 聊天相关
codeList[20900] = "聊天被限制"
codeList[20901] = "聊天内容不合法"
codeList[20902] = "场次记录不存在"
codeList[20903] = "聊天记录不存在"
codeList[20904] = "说话太快了"
codeList[20905] = "内容为空"
codeList[20906] = "内容过长"
// ---------- 成员相关
codeList[21000] = "成员不是闲置状态"
codeList[21001] = "成员不是MC"
codeList[21002] = "成员不是房主"
// ----------- 回答相关
codeList[21100] = "答案类型不存在"
codeList[21101] = "不是mc 不具备权限"
// ----------- 题目相关
codeList[21200] = "题目不存在"
codeList[21201] = "不是mc 没有权限选题"
codeList[21202] = "没有题目"
// ----------- 笔记相关
codeList[21300] = "笔记错误"
codeList[21301] = "自定义内容不能为空"